package additionalTask;

/**
 * Created by Andrii_Grygoruk on 9/11/2017.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println(MyArea.areaOfCircle(2));
    }
}

//Задание
//        Используя Intelij IDEA создать проект, пакет.
//        Создать класс MyArea, в нем объявить константу PI = 3.14 и статический метод areaOfCircle,
//        который должен принимать радиус и используя PI посчитать площадь круга.
//        Создать класс Main, где запустить данный метод.